<template>
  <div>
    <el-table :data="tableData" style="width: 100%" border>
      <el-table-column prop="id" label="序号" width="60px">
      </el-table-column>
      <el-table-column prop="pro" label="项目">
      </el-table-column>
      <el-table-column prop="index" label="具体指标">
      </el-table-column>
      <el-table-column prop="content" label="测评内容">
      </el-table-column>
      <el-table-column prop="standard" label="评价标准和办法">
      </el-table-column>
      <el-table-column prop="reason" label="证明材料">
        <el-upload class="upload-demo" action="https://jsonplaceholder.typicode.com/posts/">
          <el-button class="btncom">上传资料</el-button>
        </el-upload>
      </el-table-column>
      <el-table-column prop="qt" label="自评理由">
        <template slot-scope="scope">
          <el-input id="input1" type="textarea" autosize placeholder="自评理由" v-model="scope.row.input1">
          </el-input>
        </template>
      </el-table-column>
      <el-table-column prop="mscore" label="自评">
        <template slot-scope="scope">
          <el-input id="input2" type="text" v-model="scope.row.input2"></el-input>
        </template>
      </el-table-column>
      <el-table-column prop="bscore" label="班评">
      </el-table-column>
      <el-table-column prop="yscore" label="院评">
      </el-table-column>
    </el-table>
  </div>
</template>

<script>
export default {
  name: "evaluate-show",
  data () {
    return {
      tableData: [{
        id: '1',
        pro: '01思想政治素质15分',
        index: '0101理想信念3分',
        content: '010101参加青马工程等培训班，学习小组，社团等思想政治理论研究团体，提交入党申请书',
        standard: '参加青马工程培训合格得0.4分（缺席一次扣0.2分，扣完为止；参加学习小组，思想政治理论社团或提交入党申请书得0.2分',
      },
      {
        id: '2',
        pro: '01思想政治素质15分',
        index: '0101理想信念3分',
        content: '010102积极参与思想政治类学习报告会、座谈会、征文、讲座等活动',
        standard: '主要参加者每参加一次0.5分，仅作为观众参加则得0.1分。',
      },
      {
        id: '3',
        pro: '01思想政治素质15分',
        index: '0101理想信念3分',
        content: '010103青年大学习等学习教育活动',
        standard: '青年大学习一直满分参与无缺1分，每缺一次扣0.2分。',
      },
      {
        id: '4',
        pro: '01思想政治素质15分',
        index: '0102道德品质(不设上限）',
        content: '010201模范遵守行为道德规范',
        standard: '表现良好1分，好人好事每项1分，见义勇为2分，有不文明不道德行为每次扣0.5分。',
      },
      {
        id: '5',
        pro: '01思想政治素质15分',
        index: '0103宣传思想（2分）',
        content: '010301积极参与各类新闻宣传',
        standard: '在校外媒体发表宣传报道，每篇1分，在校内广播站、网站、易班、微信公众号等官网发表宣传报道，每篇加0.2分（一稿多投以最高的计）。记者团、信息部、社团联常务部、院学生会媒体部委员此项加分基准为8篇，宣传委员加分基准为5篇，超过的每篇加0.2分（写文作者得满分，配图作者得1/2）；获评学院“优秀通讯员”加0.6分。',
      },
      {
        id: '6',
        pro: '01思想政治素质15分',
        index: '0103宣传思想（2分）',
        content: '010302易班',
        standard: '易班签到连续30天，加0.5分；易班发文每篇0.2（文章字数200字以上，经认定后加分；工作人员加分基准为8篇）；易班学院所发文章有效评论、投票等每次加0.03分。',
      },
      {
        id: '7',
        pro: '01思想政治素质15分',
        index: '0104责任意识与集体观念3分',
        content: '010401爱党、爱国、爱校、集体主义观念强。关心集体，以集体、全局利益为重，积极参加集体活动，为集体争取荣誉',
        standard: '在全校院性集会、升旗仪式、班会、团会等活动无故缺席一次扣0.4、迟到一次扣0.2分；健康打卡等疫情防控配合，无故不打卡，一次扣0.1分（可扣至负分）。',
      },
      {
        id: '8',
        pro: '01思想政治素质15分',
        index: '0105法纪观念（2分）',
        content: '010502模范遵守学校各项规章制度，无违纪、通报批评、纪律处分等',
        standard: '无违纪得1分，普通学生、学生干部、学生党员，受留校察看处分分别扣3、4、5分，受记过以下处分分别扣1、2、3分，受通报批评分别扣0.5、1、1.5分。（可扣至负分）。',
      },//第一部分
      {
        id: '9',
        pro: '02专业发展素质70分',
        index: '0201学习成绩（65分）',
        content: '020101必修课学习成绩',
        standard: '根据学生上一学期各门课程的平均绩点进行折算，公式为：学分绩点≧1时，F=（A*10+50）/100*65，学分绩点<1时，F=A*60%*65。',
      },
      {
        id: '10',
        pro: '02专业发展素质70分',
        index: '0202学习态度（3分）',
        content: '020201课堂、自习出勤情况。',
        standard: '课堂、自习无缺勤。迟到、早退得3分，缺勤一次扣0.2分，迟到、早退一次扣0.1分，正常行课期间在寝室打游戏，扣0.5分/次（可扣至负分）。',
      },
      {
        id: '11',
        pro: '02专业发展素质70分',
        index: '0203学习效果（1分）',
        content: '020301学习方面获奖情况。',
        standard: '政府、社会及以上奖学金分别加0.5分，可累加（除校设奖学金外）。',
      },
      {
        id: '12',
        pro: '02专业发展素质70分',
        index: '0204专业技能（8分）',
        content: '020401外语能力。',
        standard: '当学期通过英语四、六级分别加2、4分，以后每学期加1、2分（选最高项加分）。托福、雅思等凭相关证书加5分。',
      },
      {
        id: '13',
        pro: '02专业发展素质70分',
        index: '0204专业技能（8分）',
        content: '020402计算机应用能力。',
        standard: '当学期通过计算机二级或internet操作员等加1分，获三级及以上相关证书、程序员证等（计算机专业以高级程序员为标准）可加2.5分，四级或网络工程师等加4分，以后每学期加0.8、1.5、2分。（选择最高项加分）。',
      },
      {
        id: '14',
        pro: '02专业发展素质70分',
        index: '0204专业技能（8分）',
        content: '020403参加培训获得其他科技类、文体类技能水平的相关证书',
        standard: '各类技能证书2分/项，各类培训证书1分/项。（限当学期所获证书）',
      },
      {
        id: '15',
        pro: '02专业发展素质70分',
        index: '0204专业技能（8分）',
        content: '020404学术实践与创新。',
        standard: '发表论文一般刊物每篇加2分、核心刊物加5分，实用专利、软件著作权等每项加2分，发明专利每项加3分。',
      },
      {
        id: '16',
        pro: '03综合发展素质15分',
        index: '0301体育与健康（5分）',
        content: '030101坚持体育锻炼，提高身心素质，能适应环境变化，人际关系良好',
        standard: '表现良好得0.5分，出现和同学间纠纷、打架斗殴等，一次扣1分。',
      },
      {
        id: '17',
        pro: '03综合发展素质15分',
        index: '0301体育与健康（5分）',
        content: '030102积极参加各类体育赛事',
        standard: '运动会、体育节等比赛按国家级、省部级、市校级、校区级、院级参与分别加2、1、0.5、0.4、0.3分，获奖分别加5、3、1、0.5、0.5分（获奖不加参与分，以证书为准）；运动会方阵人员、素质拓展活动作为观众参加1次加0.1分（工作人员以3次为基准，超过的加0.1分/次）',
      },
      {
        id: '18',
        pro: '03综合发展素质15分',
        index: '0302文化与审美（5分）',
        content: '030201积极参加各级各类文化艺术等活动及比赛；积极参加校区、学院各类素质拓展活动',
        standard: '比赛按国家级、省部级、市校级、校区级、院级参与分别加2、1、0.5、0.4、0.3分，获奖分别加5、3、1、0.5、0.5分（获奖不加参与分，以证书为准）；素质拓展活动作为观众参加1次加0.1分（工作人员以3次为基准，超过的每次加0.2分）；网络竞赛获一等、二等、三等、优秀奖分别加0.5、0.3、0.2、0.1分。',
      },
      {
        id: '19',
        pro: '03综合发展素质15分',
        index: '0302文化与审美（5分）',
        content: '030202积极参加大学生文化素质项目、进德修业项目等申报',
        standard: '结项后凭相关证书加分，一般项目、培育项目0.8分，重点项目1.5分。',
      },
      {
        id: '20',
        pro: '03综合发展素质15分',
        index: '0303劳动与实践（5分）',
        content: '030301积极参加学校、学院组织的各类劳动教育活动，个人保持良好卫生习惯，自觉遵守寝室管理制度，积极参加寝室建设活动',
        standard: '校级寝室评比中获奖每次加0.6分。星级寝室评比优秀寝室长、自管员加0.5分，星级寝室按级别成员每次分别加0.3、0.2、0.1分。内务通报批评一次扣0.2分。根据青年服务部给出每个寝室内务平均分。排名专业年级后2%的寝室各成员扣0.2分。宿舍违章用电每次扣2分。其他劳动教育类相关活动，经认定后每次加0.1分（可扣至负分）。',
      },
      {
        id: '21',
        pro: '03综合发展素质15分',
        index: '0303劳动与实践（5分）',
        content: '030302积极参加志愿者行动和志愿服务活动等，在活动中有突出成绩或被评为先进个人',
        standard: '参与国家级、省部级、市校级、院级志愿活动分别加1、0.6、0.3、0.2分。获评优秀志愿者分别得4、3、1.5、0.8分，如带领团队获得优秀志愿组织等荣誉，负责人另按国家级、省部级、市校级、院级分别加4、3、1.5、0.8分。以获得证书或证明为准。',
      },
      {
        id: '22',
        pro: '03综合发展素质15分',
        index: '0304科技与创新（6分）',
        content: '030401参加各类创新创业训练计划、比赛等',
        standard: '参与一次加0.5分；通过验收立项，国家级、省部级、市校级分别加3、2、1分；获奖分别可得5、3、1分。（一个项目以最高项加）',
      },
      {
        id: '23',
        pro: '03综合发展素质15分',
        index: '0304科技与创新（6分）',
        content: '030402学科竞赛',
        standard: '参与国家级、省级、市校级、院级（2、1、0.5、0.2分，获国家级一、二、三等奖分别加（5、4、3），省部级（4、3、2），市校级、院级（0.5、0.3）。（获奖不加参与分）',
      },
      {
        id: '24',
        pro: '03综合发展素质15分',
        index: '0304科技与创新（6分）',
        content: '030403课外开放性实验。',
        standard: '参加并验收合格获0.8分，获优秀加2分.',
      },
      {
        id: '24',
        pro: '03综合发展素质15分',
        index: '0305组织能力（6分）',
        content: '校、院主席团成员、班导生',
        standard: '考核优秀3分，良好2.5分，合格2分，不合格0分',
      },
      {
        id: '25',
        pro: '03综合发展素质15分',
        index: '0305组织能力（6分）',
        content: '校、院部门正、副部长，班长、团支书，社团负责人',
        standard: '考核优秀2.5分，良好2分，合格1.5分，不合格0分',
      },
      {
        id: '26',
        pro: '03综合发展素质15分',
        index: '0305组织能力（6分）',
        content: '易班负责人、考研联盟负责人、就业服务队负责人、心理服务部负责人、国旗护卫队队长、学科竞赛队队长等',
        standard: '考核优秀2分，良好1.5分，合格11.3分，不合格0分',
      },
      {
        id: '27',
        pro: '03综合发展素质15分',
        index: '0305组织能力（6分）',
        content: '校（院、班、部门、党支部）委员、学工助理、社团联理事、学院兴趣小组组长、学院文体类团队队长等',
        standard: '考核优秀1.5分，良好1.3分，合格1分，不合格0分',
      },
      {
        id: '28',
        pro: '03综合发展素质15分',
        index: '0305组织能力（6分）',
        content: '寝室长',
        standard: '考核优秀0.8分，良好0.5分，合格0.3分',
      },
      {
        id: '29',
        pro: '03综合发展素质15分',
        index: '0305组织能力（6分）',
        content: '社团（社团联下属社团）成员、学科竞赛队队员、学院兴趣小组成员、学院文体类团队成员等',
        standard: '考核优秀0.5分，良好0.3分，合格0.1分（上限1分，最多算2个社团）注：青志协不是社团。',
      },
      {
        id: '30',
        pro: '03综合发展素质15分',
        index: '0305组织能力（6分）',
        content: '030502个人获相关荣誉',
        standard: '获飞翔奖加3分；获十佳优秀学生干部、十佳三好学生、飞翔奖提名奖等，每项加2分；飞翔奖入围奖、优秀学生干部、优秀团干部、优秀三好学生、优秀团员等荣誉称号，每项加1分。',
      },
      {
        id: '31',
        pro: '03综合发展素质15分',
        index: '0305组织能力（6分）',
        content: '030503所在集体获相关荣誉',
        standard: '获飞翔奖最佳团队奖加3分；获飞翔奖最佳团队提名奖加2分；获十佳先进班级、五四红旗团支部、飞翔奖优秀团队入围奖等，每项加1分；先进班级、优秀团支部，每项加0.4分；获学院认可的院级类集体奖项加0.2分',
      },
      {
        id: '32',
        pro: '04额外10分',
        index: '其他',
        content: '040101在其他方面成绩突出，为集体争得荣誉，为学校精神文明建设做出贡献者。或其他在实践创新方面有突出表现，获得一定成绩的；其他方面辅导员认为该扣分的项目',
        standard: '学分绩点专业前10名，依次加10、9、7、6、5、4、3、2、1、0.5分。其他突出成绩由参评者提出申请，辅导员认定；扣分项目由测评小组或辅导员提出，辅导员审核认定。（此项基础分为0分，加减分不得与以上各项内容重复，最低扣至-10分）',
      },
      ],
    }
  },
  methods: {

  }
}
</script>

<style  scoped>
.btncom {
  margin-left: 50%;
}
</style>